external/swak/examples/groovyBC/circulatingSplash/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver PCG;
        preconditioner
        {
            preconditioner   GAMG
            tolerance        1e-3;
            relTol           0;

            smoother         GaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nBottomSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        1e-4;
        relTol           0;
        maxIter          100;
    };

    p_rgh
    {
        solver GAMG;
        tolerance        1e-8;
        relTol           0.05;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration false;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pd {
        $p_rgh;
    };

    p_rghFinal
    {
        solver PCG;
        preconditioner
        {
            preconditioner   GAMG
            tolerance        1e-8;
            relTol           0;

            nVcycles         2;

            smoother         GaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nFinestSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        1e-8;
        relTol           0;
        maxIter          20;
    };

    pdFinal {
        $p_rghFinal;
    };

    U
    {
        solver smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-6;
        relTol           0;
        nSweeps          1;
    };

    k
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    B
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    nuTilda
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    nAlphaCorr      1;
    nAlphaSubCycles 3;
    cAlpha          1;
    pRefCell       0;
    pRefValue      0;
    pRefProbe
    {
        fields  (pd);
        probeLocations ((0.01 0.01 0.01));
    };
}

PIMPLE {
    $PISO;
}

// ************************************************************************* //
